"use strict";
exports.__esModule = true;
exports.arrayTypescript = exports.linksTypescript = void 0;
exports.linksTypescript = [
    {
        href: "https://habr.com/ru/company/macloud/blog/559902/",
        title: "Карманная книга по TypeScript. Часть 1. Основы"
    },
    {
        href: "https://habr.com/ru/companies/macloud/articles/563722/",
        title: "Карманная книга по TypeScript. Часть 8. Модули"
    },
    {
        href: "https://create-react-app.dev/docs/adding-typescript/",
        title: "npx create-react-app my-app --template typescript"
    },
    {
        href: "http://json2ts.com/",
        title: "json2ts generate TypeScript interfaces from JSON"
    },
    {
        href: "https://metanit.com/web/typescript/3.3.php",
        title: "METANIT.COM Сайт о программировании. TypeScript."
    },
    {
        href: "https://felixgerschau.com/react-typescript-context/",
        title: "Как использовать React Context с TypeScript"
    },
    {
        href: "https://altrim.io/posts/axios-http-client-using-typescript",
        title: "HTTP-клиент Axios с использованием TypeScript"
    },
    {
        href: "https://github.com/reduxjs/redux-toolkit/blob/master/docs/usage/usage-with-typescript.md",
        title: "Подробная информация о том, как использовать каждый API Redux Toolkit с TypeScript."
    },
    {
        href: "https://github.com/codesandtags/front-end-documentation",
        title: "Front End Documentation 2023 🚀. Документация по внешнему интерфейсу 2023 г. (Фронтенд в 2023году на GitHubе) "
    },
    {
        href: "https://react-typescript-cheatsheet.netlify.app/docs/basic/setup/",
        title: "Памятка React TypeScript"
    },
    {
        href: "https://habr.com/ru/company/otus/blog/456124/",
        title: "Использование Typescript с React – руководство для новичков"
    },
    {
        href: "https://fettblog.eu/typescript-react/hooks/",
        title: "TypeScript и React: хуки"
    },
    {
        href: "https://altrim.io/posts/axios-http-client-using-typescript",
        title: "HTTP-клиент Axios с использованием TypeScript - 1"
    },
    {
        href: "https://dev.to/mperon/axios-error-handling-like-a-boss-333d",
        title: "HTTP-клиент Axios с использованием TypeScript - 2"
    },
    {
        href: "https://www.bezkoder.com/category/react/",
        title: "Пример загрузки нескольких файлов React (с Typescript)"
    },
    {
        href: "https://proglib.io/p/12-sovetov-po-vnedreniyu-typescript-v-react-prilozheniyah-2021-01-20",
        title: "12 советов по внедрению TypeScript в React-приложениях"
    },
    {
        href: "https://habr.com/ru/post/341132/",
        title: "TypeScript и React"
    },
    {
        href: "https://www.youtube.com/watch?v=hpPkwsRaWcA&t=2s",
        title: "Особенности типизации children в React компонентах"
    },
    {
        href: "https://habr.com/ru/company/ruvds/blog/419993/",
        title: "Собеседование по TypeScript: 20 вопросов и ответов"
    },
    {
        href: "https://translated.turbopages.org/proxy_u/en-ru.ru.05f50281-642bde8b-0f1821ba-74722d776562/https/hackr.io/blog/typescript-interview-questions-and-answers",
        title: "50 лучших вопросов и ответов для интервью с машинописью в 2023 году"
    },
    {
        href: "https://metanit.com/web/typescript/1.5.php",
        title: "Файл конфигурации tsconfig.json"
    },
    {
        href: "https://typescript-definitive-guide.ru/book/chapters/Primitivnye_tipy_Null,Undefined,Void,Never,Unknown/",
        title: "Примитивные типы Null, Undefined, Void, Never, Unknown"
    },
    {
        href: "https://typescript-definitive-guide.ru/book/chapters/Interfaces/",
        title: "интерфейсы"
    },
    {
        href: "https://vc.ru/dev/423888-krupnyy-gayd-po-typescript#:~:text=%D0%98%D0%BD%D1%82%D0%B5%D1%80%D1%84%D0%B5%D0%B9%D1%81%D1%8B%20%E2%80%94%20%D0%BE%D0%B4%D0%BD%D0%B0%20%D0%B8%D0%B7%20%D0%BA%D0%BB%D1%8E%D1%87%D0%B5%D0%B2%D1%8B%D1%85,%D0%B8%D0%BD%D1%81%D1%82%D1%80%D1%83%D0%BC%D0%B5%D0%BD%D1%82%20%D0%B4%D0%BB%D1%8F%20%D1%82%D0%B8%D0%BF%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8%20%D0%B2%D1%81%D0%B5%D0%B3%D0%BE%20%D0%BA%D0%BE%D0%B4%D0%B0%F0%9F%92%AB",
        title: "Крупный гайд по TypeScript от 17 мая 2022 "
    },
    {
        href: "https://metanit.com/web/typescript/2.4.php",
        title: "Type assertion. Преобразование к типу. Использование as или <>"
    },
    {
        href: "https://habr.com/ru/companies/tinkoff/articles/588655/",
        title: "Дженерики в TypeScript"
    },
    {
        href: "https://canonium.com/articles/typescript-generics",
        title: "TypeScript: Обобщённые типы (Generics)"
    },
    {
        href: "https://habr.com/ru/articles/494668/",
        title: "Могучие Typescript Декораторы — как работают, во что компилируются и для каких прикладных задач применимы"
    },
    {
        href: "https://metanit.com/web/typescript/6.1.php",
        title: "Декораторы"
    },
    {
        href: "https://habr.com/ru/companies/otus/articles/688270/",
        title: "Перегрузка функций в TypeScript"
    },
    {
        href: "https://www.typescriptlang.org/docs/handbook/enums.html",
        title: "Документация. Перечисления enum."
    },
    {
        href: "https://www.youtube.com/watch?v=FltLrtKWMak&list=PLNkWIWHIRwMEm1FgiLjHqSky27x5rXvQa&index=5",
        title: "TypeScript #3 Перечисления (Enums). webDev."
    },
    {
        href: "https://metanit.com/web/typescript/3.7.php",
        title: "Миксины"
    },
    {
        href: "https://typescript-definitive-guide.ru/book/chapters/",
        title: "Что такое TypeScript и для чего он нужен"
    },
    {
        href: "https://www.youtube.com/watch?v=r9Tt3fEjuBY",
        title: "TypeScript - Enums: Обзор и когда не надо использовать. Проверка роли."
    },
    {
        href: "https://www.youtube.com/watch?v=Bqkjv4on5Ts",
        title: "Что нового в TypeScript 5.0?"
    },
    {
        href: "https://www.youtube.com/watch?v=hGdx0hpZsvs&list=PLdTPrJkdrLGGgSnXMsO-Rix3MTuySb_mF&index=2&t=10s",
        title: "Разница между Интерфейсом и Типом в Тайпскрипт 2021. TypeScript Interface vs Type."
    },
    {
        href: "https://translated.turbopages.org/proxy_u/en-ru.ru.aa7a9a9e-642fc311-08e7da2d-74722d776562/https/www.geeksforgeeks.org/explain-about-rest-parameters-and-arguments-in-typescript/?ref=rp",
        title: "Объясните о параметрах и аргументах rest в TypeScript"
    },
    {
        href: "https://ru.hexlet.io/blog/posts/sistema-tipov-v-typescript",
        title: "TypeScript: типы и дерево иерархии"
    },
    {
        href: "https://translated.turbopages.org/proxy_u/en-ru.ru.aa7a9a9e-642fc311-08e7da2d-74722d776562/https/www.geeksforgeeks.org/explain-the-symbol-type-in-typescript/?ref=rp",
        title: "Объясните тип символа в TypeScript"
    },
    {
        href: "https://translated.turbopages.org/proxy_u/en-ru.ru.aa7a9a9e-642fc311-08e7da2d-74722d776562/https/www.geeksforgeeks.org/explain-the-concept-of-null-and-its-uses-in-typescript/?ref=rp",
        title: "Объясните концепцию null и ее использование в TypeScript"
    },
    {
        href: "https://www.youtube.com/watch?v=cVSo2lxfw54&list=PLdTPrJkdrLGGgSnXMsO-Rix3MTuySb_mF&index=6",
        title: "Что такое keyof typeof в TypeScript."
    },
    {
        href: "https://www.youtube.com/watch?v=nPSPA7_OvFg",
        title: "Литеральные типы"
    },
    {
        href: "",
        title: ""
    },
];
exports.arrayTypescript = [
    {
        heading: "Что такое TypeScript?",
        answer: [
            "TypeScript - это строго типизированный, объектно-ориентированный, компилируемый язык программирования, основанный на JavaScript.",
            "TypeScript представляет собой как язык программирования, так и набор инструментов. Это типизированный, расширенный JavaScript, компилируемый в JavaScript.",
            "Делает код понятнее и надежнее, добавляет статическую типизацию (переменные привязаны к конкретным типам данных), а также может быть скомпилирован в JavaScript. TypeScript используют фронтенд - и бэкенд-разработчики.",
            "В отличие от JavaScript, TypeScript — это язык программирования со статической типизацией. Как средство проверки статического типа, TypeScript будет проверять поведение определенных переменных перед запуском вашей программы. Это имеет место даже в том случае, когда вы объявляете переменные без указания их типа. В таких ситуациях TypeScript может автоматически назначать типы объявленным переменным.",
            "-*-",
            "Главная задача тайпскрипта, это внести типы в нетипизированный язык javascript. Благодаря типам, мы сможем быстро рефакторить проекты, поддерживать огромные проекты, а так же писать более качественный код, который будет основан уже на поведении типов.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое JavaScript?",
        answer: [
            "JavaScript — это кросс-платформенный, объектно-ориентированный скриптовый язык (язык сценариев), являющийся небольшим и легковесным. Внутри среды исполнения JavaScript может быть связан с объектами данной среды и предоставлять программный контроль над ними.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "В чем различия между TypeScript и JavaScript?",
        answer: [
            "1. TypeScript - это объектно-ориентированный язык программирования, в то время как JavaScript - это объектно-ориентированный язык сценариев.",
            "2. Объектно-ориентированные языки программирования основаны на объектах, тогда как языки сценариев состоят из сценариев для автоматизации какой-либо функции/действия.",
            "3. Языки сценариев не нуждаются в этапе компиляции и в основном интерпретируются.",
            "4. TypeScript всегда обращает внимание на ошибки в период разработке, но JavaScript выделяет их во время выполнения.",
            "5. TypeScript поддерживает статическую типизацию, в то время как JavaScript имеет динамическую типизацию.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Каковы основные функции TypeScript?",
        answer: [
            "1. TypeScript поддерживает библиотеки JavaScript, что позволяет создавать более чистый и быстрый код.",
            "2. Статическая типизация: программисты могут легко выявлять проблемы по мере их отладки, ускоряя процесс тестирования и отладки.",
            "3. Удобство в использовании: разработчики могут создавать надежные и удобные веб-приложения, используя высокопроизводительные инструменты разработки с помощью TypeScript.",
            "4. Строгая история: Хотя вы можете изменять или обновлять значения элементов массива, вы не можете их удалить.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Каковы основные особенности TypeScript?",
        answer: [
            "1. Кроссплатформенность : компилятор TypeScript можно установить в любой операционной системе, такой как Windows, macOS и Linux",
            "2. Особенности ES6 : TypeScript включает в себя большинство функций запланированного ECMAScript 2015 ( ES6 ), таких как функции Arrow.",
            "3. Объектно-ориентированный язык : TypeScript предоставляет все стандартные функции ООП , такие как классы, интерфейсы и модули.",
            "4. Статическая проверка типов : TypeScript использует статическую типизацию и помогает проверять типы во время компиляции. Таким образом, вы можете найти ошибки времени компиляции при написании кода без запуска скрипта.",
            "5. Необязательная статическая типизация : TypeScript также допускает необязательную статическую типизацию, если вы привыкли к динамической типизации JavaScript.",
            "6. Управление DOM : вы можете использовать TypeScript для управления DOM для добавления или удаления элементов веб-страницы на стороне клиента.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Каковы преимущества использования TypeScript?",
        answer: [
            "1. TypeScript более выразителен , а значит, в нем меньше синтаксического беспорядка.",
            "2. Простая отладка благодаря расширенному отладчику , который фокусируется на отлове логических ошибок перед компиляцией.",
            "3. Статическая типизация делает TypeScript более удобным для чтения и более структурированным, чем динамическая типизация JavaScript.",
            "4. Может использоваться на разных платформах , как в клиентских, так и в серверных проектах благодаря универсальной транспиляции.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Тип в TypeScript:",
        answer: [
            "Система типов в TypeScript отображает различные типы данных, которые поддерживаются языком. Система разделена на три основных раздела:",
            "- любой тип,",
            "- встроенный тип и ",
            "- определяемый пользователем тип.",
            " Система типов в TypeScript отвечает за проверку типа данных любого принятого значения, прежде чем оно может быть предоставлено в качестве входных данных для программы.",
            "",
            "",
            "",
            "--",
            "Основным 'строительным материалом' в TypeScript является тип. К слову TypeScript потому так и называется, потому что у него есть типы. Они созданы для того, чтобы заранее указать тип переменной и строго соблюдать его. В TypeScript есть встроенные типы, в основном мы будем пользоваться тремя: string, number, boolean. ",
            "Типы в TypeScript работают как и в любом строготипизированном языке. Если вы указали тип у переменной и присвоили ей несоответствующий тип, то компилятор выдаст ошибку и будет ругаться.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Аннотация типа",
        answer: [
            "Как уже было сказано ранее, TypeScript — это типизированная надстройка над JavaScript. Другими словами TypeScript не добавляет никаких новых языковых конструкций (за исключением Enum, которая будет рассмотрена чуть позже), а лишь расширяет синтаксис JavaScript за счет добавления в него типов.",
            "В TypeScript аннотация типа или указание типа осуществляется с помощью оператора двоеточия :, после которого следует идентификатор типа. TypeScript является статически типизированным языком, поэтому после того как идентификатор будет связан с типом, изменить тип будет невозможно.",
            "- Аннотация типа устанавливается оператором двоеточия :, после которого следует указание типа данных.",
            "- При объявлении переменных тип данных указывается сразу после идентификатора.",
            "- У функций и методов класса возвращаемый тип данных указывается между параметрами и телом.",
            "- У стрелочных функций возвращаемый тип данных указывается между параметрами и стрелкой.",
            "- У функций, стрелочных функций и методов класса, параметрам также указывается тип данных.",
            "- При необходимости функциям, стрелочным функциям и методам класса можно указать параметры типа, которые заключаются в угловые скобки и указываются перед круглыми скобками, в которых размещаются параметры функции",
            "- В TypeScript аннотирование типов у функций, методов и конструкторов расширено при помощи перегрузки функций.",
            "- Для полей класса тип данных указывается сразу после идентификатора-имени.",
            "- Для геттеров (getters) указывается возвращаемый тип данных.",
            "- Для сеттеров (setters) указывается тип единственного параметра и вовсе не указывается возвращаемый тип.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как создать переменную в TypeScript? Различия ‘let’, ‘var’ и ‘const’ в TypeScript.",
        answer: [
            "1. ‘let’: позволяет определять переменные как в глобальной, так и в локальной областях. let — это способ объявления переменных по умолчанию в TypeScript. По сравнению с var, letон уменьшает количество ошибок во время компиляции и повышает читаемость кода.",
            " - Объявление глобальной переменной: использование let вне функции.",
            " - Объявление локальной переменной: использование let внутри функции.",
            "2. ‘var’: позволяет определять только переменные с глобальной областью видимости, независимо от того, где была определена переменная. Вы должны избегать использования, varкогда это возможно, потому что это может вызвать проблемы в больших проектах.",
            "3. ‘const’: аналогично let, за исключением того, что вы не можете изменять значение переменной const после ее определения. const создает постоянную переменную, значение которой не может измениться. Он использует те же правила области видимости, что let и помогает снизить общую сложность программы.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Файл конфигурации tsconfig.json",
        answer: [
            "С помощью файла конфигурации tsconfig.json можно настроить проект TypeScript. В частности, этот файл выполняет следующие задачи:",
            " - устанавливает корневой каталог проекта TypeScript;",
            " - выполняет настройку параметров компиляции;",
            " - устанавливает файлы проекта.",
            "Для его использования достаточно вручную добавить новый файл с именем tsconfig.json в корень проекта.",
            "Вы можете перечислить различные настройки в файле tsconfig.json, который находится в формате JSON. Это подсказывает компилятору, как скомпилировать проект. Этот файл является корневым файлом проекта TypeScript, поскольку он находится в каталоге.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое любой тип “any” и когда его использовать в TypeScript ?",
        answer: [
            "Any - это тип данных в TypeScript. Любой тип используется, когда мы имеем дело со сторонними программами и ожидаем любую переменную, но мы не знаем точного типа переменной. Любой тип данных используется, потому что это помогает при регистрации и отказе от проверки типов во время компиляции.",
            "Синтаксис:",
            "let temp: any;",
            "temp = 'string';",
            "temp = 2;",
            "temp = true;",
            "Поскольку мы ввели любой тип данных в temp, он ожидает все типы data-type и не выдает никаких ошибок. Это обеспечивает такую гибкость, что также позволяет компилятору не генерировать ошибку во время компиляции, если мы вызываем какой-либо метод для неизвестного типа, которому присвоен любой тип.",
            "--",
            "И мы убедили компилятор, что это любой тип и имеет некоторую функцию для него, но мы не знаем, что это точно. Сейчас мы видели любой тип данных, но поскольку TypeScript - это язык проверки типов, мы предоставляем переменную гибкость, но это вызывает некоторые проблемы, такие как вопросы безопасности, поэтому давайте обсудим, когда использовать любой тип данных.",
            "Любой тип используется только тогда, когда мы ничего не знаем о типе данных переменной и хотим получить динамическое содержимое из источника. Давайте посмотрим на некоторые ситуации, когда нам приходится использовать любой тип данных.",
            "--",
            "Пример 1: Предположим, мы хотим сохранить сторонние данные в массиве, но мы не знаем точного типа данных массива, поэтому мы инициализируем массив any в TypeScript, который не вызовет никаких ошибок, и мы можем обрабатывать все типы типов данных.",
            "let New_Array : any[]=[1,'data1'];",
            "New_Array.push('data2');",
            "New_Array.push(2)",
            "New_Array.push('data3');",
            "New_Array.push(3)",
            "console.log(New_Array) // [1, 'data1', 'data2', 2, 'data3', 3] ",
            "--",
            "Пример 2: Если вы используете стороннюю функцию, написанную на JavaScript, и в результате она выдает вам некоторые данные, но вы не знаете тип данных, в таком случае, если мы определяем какой-то другой тип, но он возвращает другие типы, наш код не выполняется должным образом, в таком случае мы предоставляем сторонней функции некоторую гибкость и определяем с любым типом.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое “Unknown” (неизвестный) тип  и когда его использовать в TypeScript?",
        answer: [
            "В Typescript любое значение может быть присвоено unknown, но без утверждения типа unknown не может быть присвоено ничему, кроме самого себя и any. Аналогично, никакие операции с неизвестным типом не разрешены без предварительного утверждения или ограничения его более точным типом. подобно any, мы можем присвоить неизвестному любое значение, как и любому другому; тем не менее, в отличие от any, мы не можем получить доступ к каким-либо свойствам неизвестных значений, а также вызвать или сконструировать их. Кроме того, неизвестные значения могут быть присвоены только неизвестному или любому.",
            "Неизвестный тип используется для обеспечения типобезопасности нашего кода. когда мы используем неизвестный тип, нам приходится писать дополнительный код, но, наконец, наш код будет типобезопасным. безопасность типов - это не что иное, как предотвращение ошибок типа.",
            "Давайте разберемся, когда использовать неизвестные типы, а когда нет, с помощью следующих примеров.",
            "Пример 1. В этом примере мы присваиваем неизвестной переменной значения разных типов. мы видим, что это не вызывает никаких ошибок. неизвестный тип находится на вершине, когда дело доходит до типов переменных в Typescript.",
            "- let val: unknown;",
            "console.log(val); // undefined",
            "- val = true;",
            "console.log(val); // true",
            "- val = 7;",
            "console.log(val); // 7",
            "- val = 'geeks for geeks';",
            "console.log(val); // geeks for geeks",
            "- val = [1, 2, 3, 4];",
            "console.log(val); // [ 1, 2, 3, 4 ]",
            "- val = { name: 'rachel' };",
            "console.log(val); // { name: 'rachel' }",
            "- val = Math.random();",
            "console.log(val); // 0.776446663785197",
            "- val = null;",
            "console.log(val); // null",
            "- val = undefined;",
            " console.log(val); // undefined",
            "--",
            "Пример 2. Неизвестный присваивается неизвестным и другим значениям типа",
            "Как указано во введении, переменная неизвестного типа может быть присвоена только другой переменной неизвестного типа или переменной типа any. неизвестный тип отображается как “неопределенный”.",
            "- let a: unknown;",
            "console.log(a); // undefined",
            "- let b: unknown = a;",
            "console.log(b); // undefined",
            "- let c: any = a;",
            "console.log(c); // undefined",
            "--",
            "Пример 3. В этом примере мы пытались присвоить значение неизвестного типа переменной типа number, возникает ошибка.",
            "let unknown: unknown;",
            "let num: number = unknown; // Error",
            "console.log(num); // error TS2322: Тип «неизвестный» не может быть присвоен типу «число».",
            "--",
            "Пример 4. В typescript мы не можем выполнять операции со значениями неизвестного типа. Операции с типом объекта не могут быть выполнены со значениями неизвестного типа.",
            "let unknown_val: unknown;",
            "unknown_val.split('');",
            "console.log(unknown_val); // error TS2339: Свойство «split» не существует для типа «неизвестно».",
            "--",
            "--",
            "“Unknown” — неизвестный тип переменной, у которой нет свойств и методов (только из общего прототипа), однако её можно сравнивать логическими операторами. Когда дело касается чего-то неизвестного, что нужно только проверить только на существовование, то нужно использовать unknown:",
            "“Unknown” следует использовать, если заранее не известно, какой тип ожидать, но необходимо назначить его позже, и ключевое слово “any” не будет работать.",
            "--",
            "5. Тип Unknown является типобезопасным аналогом типа “any” и представлен в виде литерала unknown. Все типы совместимы с типом unknown, в, то время как сам тип unknown совместим только с самим собой и типом any.",
            "static unknown: unknown;",
            "6. Над типом unknown запрещено выполнение каких-либо операций.",
            "7. Если тип unknown составляет тип пересечение (intersection), то он будет перекрыт всеми типами.",
            "type T0 = any & unknown; // type T0 = any",
            "type T1 = number & unknown; // type T1 = number",
            "type T2 = string & unknown; // type T2 = string",
            "type T3 = boolean & unknown; // type T3 = boolean",
            "type T4 = null & unknown; // type T4 = null",
            "type T5 = undefined & unknown; // type T5 = undefined",
            "type T6 = void & unknown; // type T6 = void",
            "type T7 = never & unknown; // type T7 = never",
            "type T8<T> = T & unknown; // type T8 = T",
            "type T9 = unknown & unknown; // type T9 = unknown",
            "--",
            "8. Если тип unknown составляет тип объединение (union), то он перекроет все типы, за исключением типа any.",
            "type T0 = any | unknown; // type T0 = any",
            "type T1 = number | unknown; // type T1 = unknown",
            "type T2 = string | unknown; // type T2 = unknown",
            "type T3 = boolean | unknown; // type T3 = unknown",
            "type T4 = null | unknown; // type T4 = unknown",
            "type T5 = undefined | unknown; // type T5 = unknown",
            "type T6 = void | unknown; // type T6 = unknown",
            "type T7 = never | unknown; // type T7 = unknown",
            "type T8<T> = T | unknown; // type T8 = unknown",
            "type T9 = unknown | unknown; // type T9 = unknown",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Когда используется ключевое слово “unknown”  ",
        answer: [
            "Когда вы не хотите использовать ключевое слово any и/или заранее не знаете точный тип, но хотите назначить его позже.",
            "Пример:",
            "let person: unknown = 'John';",
            "if (typeof person === string) {",
            "let name: string = person;",
            "} ",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "“Void” (void) отсутствие конкретного типа",
        answer: [
            "Данный тип предназначен для определения отсутствующих типов. ",
            "Например в функции отсутствует слово return, значит функция не возвращает никакого значения. Следовательно, результат выполнения функции это отсутствующий тип или void, который мы и указали.  ",
            "--",
            "Тип void является уникальным для TypeScript. В JavaScript подобного типа не существует.",
            "Тип данных Void можно назвать полной противоположностью типа any, так как этот тип означает отсутствие конкретного типа. Основное предназначение типа Void — явно указывать на то, что у функции или метода отсутствует возвращаемое значение.",
            "Тип данных Void указывается с помощью ключевого слова void (не путать с одноимённым оператором из JavaScript) и, в отличие от таких типов, как null и undefined, не имеет никаких значений. Тип void является подтипом any и супертипом для null и undefined.",
            "В отличие от null и undefined, тип void не имеет ни одного значения, которое могло бы явно продемонстрировать присвоение. Однако компилятор понимает, что имеет дело с типом void при вызове функции или метода, которые не возвращают значение. Этот становится ещё нагляднее, когда вывод типов устанавливает тип полученный при вызове функции или метода которые ничего не возвращают.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое примитивный тип “never” (“никогда”) в TypeScript?",
        answer: [
            "Данный тип может использоватьс в 2-х случаях: ",
            "1. Это когда функция возвращает ошибку и не заканчивает своё выполнение.",
            "2. Это когда функция действительно постоянно выполняется, например находится в бесконечном цикле.",
            "Данный тип очень тесно связан с функциями, и “never” говорит о том, что мы результата не получим.",
            "",
            "",
            "Тип never является уникальным для TypeScript. В JavaScript подобного типа не существует.",
            "Примитивный тип данных Never служит для указания операций, которые никогда не будут выполнены.",
            "Тип never представляет собой тип значений, которые никогда не встречаются, которых никогда не будет. ",
            "Тип never обозначает функции, которые никогда не вернут определённого значения.",
            "--",
            "В TypeScript есть проверка типов и проверка во время компиляции. Однако мы не всегда можем знать заранее тип некоторых переменных, особенно когда есть введённые пользователем значения из сторонних библиотек. Тип never используется, когда вы уверены, что что-то никогда не произойдёт. Например, вы пишите функцию, которая не возвращается к своей конечной точке и всегда выдаёт исключение.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "В чем разница между void и never в TypeScript?",
        answer: [
            "В TypeScript есть два псевдо-типа данных обозначающих 'ничто': void и never. Чем они отличаются и как понять когда применять void, а когда never?",
            "Псевдо-тип never означает, что функция никогда не возвращает значения. Такое может быть, например, в случае если функция всегда выбрасывает исключение:",
            "function f(): never {",
            "throw new Error('Never return');",
            "}",
            "--",
            "Псевдо-тип void означает, что функция возвращает undefined. Это происходит в случае, если поток выполнения доходит до конца функции, не встретив конструкции return:",
            "function f(arg): void {",
            "console.log(arg);",
            "}",
            "или когда конструкция return используется без указания аргумента:",
            "function f(arg): void {",
            "if (arg < 0) {",
            "return;",
            "}",
            "console.log(arg);",
            "}",
            "--",
            "Если говорить о выборе между void и never, то вам почти всегда нужно выбирать именно void. Все дело в том, что never используется в совсем уж экзотических ситуациях, поэтому его можно смело исключать из набора типов 'на каждый день'.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Null (null) примитивный null тип",
        answer: [
            "Null относится к значению, которое является либо пустым, либо значением, которое не существует. Это специально, что здесь нет значения. TypeScript не присваивает переменной значение null по умолчанию. По умолчанию неназначенные переменные или переменные, которые объявлены без инициализации, являются 'неопределенными’. Чтобы сделать переменную null, мы должны присвоить ей значение Null. Typescript использует null для представления переменных, у которых отсутствует значение или которым не присвоено значение, короче говоря",
            "Иногда при написании огромных кодов можно допустить такие ошибки, и они могут привести к нежелательным ошибкам.",
            "--",
            "Пример 1: Присвоение null значениям",
            "let str: string;",
            "console.log(str); // undefined",
            "// Присвоение 'null' переменной",
            "str = null;",
            "console.log(str); // null",
            "--",
            "Пример 2: Мы не можем присваивать значения других типов переменным типа null (кроме null и undefined).",
            "Мы не можем присваивать значения других типов переменной, которая объявлена как тип null. могут быть назначены только null и undefined.",
            "let num1: null;",
            "- num1 = null;",
            "console.log(num1); // null",
            "- num1 = undefined;",
            "console.log(num1); // undefined",
            "- num1 = 20;",
            "console.log(num1); // error TS2322: Тип «20» не может быть присвоен типу «null».// 20",
            "--",
            "Пример 3: Значение null не может быть присвоено переменным неопределенного типа:",
            "let var1: undefined;",
            "var1 = null;",
            "console.log(var1); // Тип 'null' не может быть присвоен типу 'undefined'.ts(2322)",
            "--",
            "Пример 4: Проверка, является ли переменная Null",
            "Поскольку оператор typeof возвращает объект, его нельзя использовать для проверки наличия null. В результате вы можете использовать либо операторы == , либо === .",
            "В приведенном ниже коде мы можем видеть, что оператор typeof возвращает объект. При проверке с помощью ‘==’ он возвращает значение true, когда переменная == null, но он также возвращает значение true, когда значение null == undefined. Но когда мы используем оператор строгого равенства, ‘false’ возвращается при сравнении null с undefined.",
            "let variable: null;",
            "variable = null;",
            "- console.log(typeof variable) // object",
            "- console.log(variable == null); // true",
            "- console.log(variable == undefined); // true",
            "- console.log(null == undefined); // true",
            "- console.log(variable === undefined); // false",
            "- console.log(null === undefined); // false",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Undefined (undefined) примитивный неопределенный тип",
        answer: [
            "Тип undefined идентичен по своей работе с одноимённым типом из JavaScript.",
            "Примитивный тип undefined указывает на то, что значение не определено. Тип данных undefined указывается с помощью ключевого слова undefined (не путать со свойством глобального объекта undefined, которое представляет единственное значение типа Undefined).",
            "let identifier: undefined = undefined; // undefined, указанный после оператора двоеточия, это имеющийся только в TypeScript псевдоним (alias) для глобального типа Undefined. В, то время как undefined, указанный после оператора присваивания, это единственное значение типа Undefined.",
            "Во время выполнения объявленные, но не инициализированные переменные, поля и свойства класса, а также параметры имеют значение undefined. Также значение undefined является результатом вызова методов или функций, которые не возвращают значения.",
            "Тип undefined является подтипом всех типов, что делает его совместимым со всеми остальными типами.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "В TypeScript имеются следующие базовые типы:",
        answer: [
            " - number : используется для представления значений чисел. Все числа в TypeScript хранятся как значения с плавающей запятой.",
            " - string : строки заключаются в одинарные или двойные кавычки.",
            " - Boolean: логический тип данных. Имеет значение true или false.",
            " - Null: Null представляет переменную, значение которой не определено.",
            " - Undefined: литерал, который является отправной точкой всех переменных.",
            " - Void: тип, присвоенный методам, не имеющим возвращаемого значения.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Тип массив:",
        answer: [
            "Есть два способа определения массивов:",
            "1. let list: numder[] = [ 1, 2, 3 ]",
            "2. let list: Array<number> = [ 1, 2, 3 ]",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Тип кортеж Tuple",
        answer: [
            "Кортеж, это массив определённого размера, длина которого не изменяется и выступает как константа в мире массивов.",
            "Есть два способа определения кортежей.",
            "1. let x: [ string, number ]",
            "x = [ 'colos', 42 ]",
            "Внутри массива мы определяем будущие типы, а затем присваиваем в переменную соответствующий массив.",
            "2. let y = [ string, number ] = [ 'goodbuy', 42 ] ",
            "Делаем тоже самое, только в одну строку. Разница в том, что если массив будет содержать набор из 10-ти разных элементов, которые нужно описать, то удобнее использовать первый случай. Причём, если вдруг при инициализации, произошла ошибка, и порядок типов данных изменился, то мы узнаем об этом, получив ошибку. ",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Enum (enum) примитивный перечисляемый тип. 1. Числовые перечисления",
        answer: [
            "Перечисления enum — это одна из немногих функций TypeScript, которая не является расширением JavaScript на уровне типов.",
            "Enum — это такая сущность, которая помогает нам структурировать однотипные элементы. Представляет из себя некую смесь объекта и массива.",
            "Enum позволяет нам удобно обращаться к своим данным в обоих направлениях. Элементы Enum нумеруются. По умолчанию, эта нумерация начинается с нуля и идёт по порядку. Однако, этот порядок мы можем изменять, создавая свой индекс. Периодически такая необходимость может возникнуть. ",
            "Enum — это конструкция, состоящая из набора именованных констант, именуемая списком перечисления и определяемая такими примитивными типами, как number и string. Enum объявляется с помощью ключевого слова enum. ",
            "1. Числовые перечисления",
            "enum Direction {",
            " Up = 1,",
            " Down,",
            " Left,",
            " Right,",
            "}",
            "При обращению к значению enum, возвращается его индекс. ",
            "Direction.Up // 0",
            "Direction.Down // 1",
            "Direction.Left // 2",
            "Direction.Right // 3",
            "--",
            " Получить данные из enum мы можем по значению и по ключу:",
            "Direction[0] // Up ",
            "Direction[1] // Down ",
            "Direction[2] // Left ",
            "Direction[3] // Right ",
            "--",
            "Выше индекс перечисления начинается с нуля, но никто не мешает нам, путём переопределения, создать индекс для любого элемента или для каждого. ",
            "enum Direction {",
            " Up = 2, // создаём индекс со значением 2 ",
            " Down = 4, // создаём индекс со значением 4",
            " Left = 6, // создаём индекс со значением 6",
            " Right, // здесь мы не создаём индекс. Кампилятор сделает это за нас, создаст индекс, значение которого будет зависить от предыдущего. ",
            "}",
            "",
            "Direction.Up // 2",
            "Direction.Down // 4",
            "Direction.Left // 6",
            "Direction.Right // 7",
            "Обращаем внимание на Direction.Right. Его значение равно 7. Не 0, не 1, так как при создании перечисления индекс следующего элемента, значение которого не задано, зависит от предыдущего. ",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Enum (enum) примитивный перечисляемый тип. 2. Строковые перечисления ",
        answer: [
            "TypeScript позволяет указывать значения с типом string. Строковые перечисления представляют собой аналогичную концепцию, но имеют некоторые тонкие различия во время выполнения , как описано ниже. В строковом перечислении каждый член должен быть инициализирован константой строковым литералом или другим членом строкового перечисления.",
            "enum Direction {",
            " Up = 'UP',",
            " Down = 'DOWN',",
            " Left = 'LEFT',",
            " Right = 'RIGHT',",
            "}",
            "--",
            "У нас создаётся анонимная, самовызывающая функция, которая создаёт объект. Из перечисляемых аргументов enum собирается объект, содержащий ключ и соответствующее этому ключу значение.",
            "var Direction;",
            "(function (Direction) {",
            " Direction[ 'Up' ] = 'UP';",
            " Direction[ 'Down' ] = 'DOWN';",
            " Direction[ 'Left' ] = 'LEFT';",
            " Direction[ 'Right' ] = 'RIGHT';",
            "})(Direction || (Direction = {}));",
            "--",
            "Здесь идёт перечисление, без задания имён. Реализован механизм удобного обращения по ключам и значениям. Общий механизм создания тот же самый, только теперь, вместо жёсткого задания ключей, идёт конструктирование объекта с перелинковкой на самого себя. Это и есть тот механизм, который помогает обращаться к элементам набора и по значеню и по индексу.",
            "var Direction;",
            "(function (Direction) {",
            " Direction[ Direction[ 'Up' ] = 0 ] = 'UP';",
            " Direction[ Direction[ 'Down' ]  = 1 ]= 'DOWN';",
            " Direction[ Direction[ 'Left' ] = 2 ] = 'LEFT';",
            " Direction[ Direction[ 'Right' ] = 3 ] = 'RIGHT';",
            "})(Direction || (Direction = {}));",
            "--",
            "Фича - как правильно создавать перечисление и минимизировать выходной код. Просто написав enum и описав его перечисляемые значения, мы всегда получим генерацию объекта через функцию. Даже, если этот объект в переспективе не будет использоваться. ",
            "Если стоят требования к минимизации кода, то можно воспользоваться константными перечислениями. При создании, перед словом enum добавляется const.",
            "const enum direction;",
            " Up = 'UP';",
            " Down = 'DOWN';",
            " Left = 'LEFT';",
            " Right = 'RIGHT';",
            "У нас нет обращения к enum direction, соответственно, создавать объект тоже не нужно. Но если попытаемся создать обращение к какому либо элемету enum, то только тогда в сгенерируемом коде мы получим значения.",
            "const arr = [ direction.Up, direction.Down, direction.Left, direction.Right ]",
            "--",
            "3. Смешанное перечисление (mixed enum). Если в одном перечислении объявлены числовые и строковые константы, то такое перечисление называется смешанным (mixed enum).",
            "enum Stones {",
            "Peach, // 0",
            "Apricot = 'apricot'",
            "}",
            "--",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Тип Объединение (Union Types)",
        answer: [
            "Объединение (Union) — это мощный механизм позволяющий создавать из множества существующих типов логическое условие по которому данные могут принадлежать только к одному из указанных типов. Объединение указывается с помощью оператора прямой черты |, по обе стороны которой располагаются типы данных.",
            "let v1: T1 | T2 | T3;",
            "Переменной, которой был указан тип объединения A или B или C, может быть присвоено значение, принадлежащие к одному из трех типов.",
            "class A { a: number }",
            "class B { b: string }",
            "class C { c: boolean }",
            "let identifier: A | B | C; // значение может принадлежать только одному типу (A или B или C)",
            "Поскольку значение может принадлежать ко множеству порой несовместимых типов, компилятор, без вмешательства разработчика, то есть без конкретизации типа, определяет принадлежность значения к типу который наделен общими для всех типов признаками.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Тип Пересечение (Intersection Type)",
        answer: [
            "Пересечение (Intersection) — ещё один мощный механизм TypeScript, который позволяет рассматривать множество типов данных как единое целое. Пересечение указывается с помощью оператора амперсанда & по обе стороны от которого указываются типы данных.",
            "let v1: T1 & T2 & T3;",
            "Переменной, которой был указан тип пересечение A и B и С должно быть присвоено значение принадлежащее к типам A и B и C одновременно. Другими словами значение должно обладать всеми обязательными признаками каждому типа определяющего пересечение.",
            "class A { a: number }",
            "class B { b: string }",
            "class C { c: boolean }",
            "let name: A & B & C; // значение должно принадлежать ко всем типам одновременно",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Примитивные типы Number, String, Boolean, Symbol, BigInt",
        answer: [
            "1. Number (number) примитивный числовой тип. ",
            "В TypeScript, как и в JavaScript, все производные от number являются 64-битными числами двойной точности с плавающей запятой.",
            "Помимо того, что в TypeScript существует тип Number представляющий конструктор одноименного типа из JavaScript, также существует тип number представляющий примитивные значения числовых литералов.",
            "2. String (string) примитивный строковый тип.",
            "Примитивный тип String представляет собой последовательность символов в кодировке Unicode UTF-16. Строки могут быть заключены в одинарные или двойные кавычки, а также в обратные апострофы (инициаторы так называемых шаблонных строк).",
            "Помимо того, что в TypeScript существует тип String описывающий одноименный конструктор из JavaScript, также существует тип string представляющий примитивные значения строковых литералов.",
            "3. Boolean (boolean) примитивный логический тип.",
            "Примитивный тип Boolean является логическим типом и представлен значениями 'истина' true и 'ложь' false.",
            "Помимо того, что в TypeScript существует тип Boolean представляющий одноименный конструктор из JavaScript, также существует тип boolean представляющий примитивные значения логических литералов.",
            "4. Symbol (symbol) примитивный символьный тип.",
            "Примитивный тип Symbol предоставляет уникальные идентификаторы, которые при желании могут использоваться в качестве индексируемых членов объекта.",
            "Помимо того, что в TypeScript существует тип Symbol описывающий одноименный конструктор из JavaScript, также существует тип symbol, представляющий примитивные значения литералов.",
            "5. BigInt (bigint) примитивный числовой тип.",
            "BigInt — примитивный числовой тип позволяющий безопасно работать с числами произвольной точности, в том числе значениями выходящими за пределы установленные типом Number. Примитивный тип BigInt указывается с помощью ключевого слова bigint.",
            "Но стоит заметить, что на данный момент (конец 2018 года) из-за плохой поддержки типа BigInt TypeScript позволяет работать с ним лишь при установленной опции компилятора --target в значение ESNext.",
            "Тип bigint предназначен для аннотирования числовых значений с произвольной точностью. В TypeScript поведение типа BigInt идентично поведению одноимённого типа в JavaScript.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Примитивные типы Null, Undefined, Void, Never, Unknown",
        answer: [
            "1. Null (null). Примитивный тип Null служит обозначением “ничего”.",
            "2. Undefined (undefined). Примитивный тип undefined указывает на то, что значение не определено.",
            "3. Void (void) отсутствие конкретного типа. Тип данных Void можно назвать полной противоположностью типа any, так как этот тип означает отсутствие конкретного типа. Основное предназначение типа Void — явно указывать на то, что у функции или метода отсутствует возвращаемое значение.",
            "4. Never (never) примитивный тип. Примитивный типа данных Never служит для указания того, что какие-либо операции никогда не будут выполнены.",
            "5. Unknown (unknown). Тип Unknown является типобезопасным аналогом типа any и представлен в виде литерала unknown.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Запросы Типа (Type Queries)",
        answer: [
            "Как сначала определить сложное значение, а затем одной строкой описать его тип? Или как конкретизировать более общий идентификатор типа и тем самым увеличить семантическую привлекательность кода? ",
            "Механизм запроса типа позволяют получить тип связанный со значением по его идентификатору и в дальнейшим использовать его как обычный тип. Запрос типа осуществляется оператором typeof после которого идет идентификатор ссылающийся на значение. Запрос типа также может располагаться в местах указания типа.",
            "let v1: T1;",
            "let v2: typeof v1; // let v2: T1;",
            "--",
            "С помощью данного механизма можно получить тип любой конструкции будь, то переменная, параметр функции или метода, а также членов объекта и класса.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Псевдонимы Типов (Type Aliases)",
        answer: [
            "Создание псевдонимов типа (types alias) — ещё одна из множества возможностей TypeScript которые невозможно переоценить. Псевдоним типа объявляется при помощи ключевого слова type, после которого следует идентификатор (имя) псевдонима, а за ним идет оператор присваивания =, справа от которого находится тип, ассоциирующийся с псевдонимом.",
            "type Alias = T1;",
            "--",
            "Так как псевдонимы типов являются лишь псевдонимами для реальных типов, они не оставляют следа в коде после компиляции, к тому же их нельзя было расширять (extends) и реализовать (implements) в ранних версиях языка (до 2.7). Сейчас псевдоним типа можно реализовать или расширить, только если он представляет объектный тип (object type) или пересечение объектных типов со статически известными членами. Кроме того, псевдонимы типов нельзя использовать в таких операциях с типами времени выполнения как typeof и instanceof. Если псевдоним типа будет создан для объекта, то при попытке создать его экземпляр возникнет ошибка.",
            "--",
            "Псевдонимы типов можно создавать как для типов объединений, так и для типов пересечений.",
            "type SomeType = number | string | boolean; // union type",
            "type OtherType = number & string & boolean; // intersection type",
            "--",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Tuple ([T0, T1, …, Tn]) тип кортеж",
        answer: [
            "Тип Tuple - кортеж задает уникальный тип для каждого элемента массива. Перечисляемые типы обрамляются в квадратные скобки, а их индексация, так же как у массива начинается с нуля - [T1, T2, T3]. Типы элементов массива, выступающего в качестве значения, должны быть совместимы с типами обусловленных кортежем под аналогичными индексами.",
            "Другими словами, если кортеж составляет последовательность типов string и number, то в качестве значения должен выступать массив, первый элемент которого совместим с типом string, а второй с number. В иных ситуациях неизбежно возникнет ошибка.",
            "Длина массива-значения должна соответствовать количеству типов, указанных в Tuple.",
            "Но это правило не мешает добавить новые элементы после того, как массив был присвоен ссылке (ассоциирован со ссылкой). Но элементы, чьи индексы выходят за пределы установленные кортежем, обязаны иметь тип, совместимый с одним из перечисленных в этом кортеже.",
            "type Tuple = [number, string, boolean, number, string];",
            "let v2: Tuple= [ 2,'koka', true, 21, 'kola'];",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Interfaces. Общая теория.",
        answer: [
            "Несмотря на то, что тема относящаяся к интерфейсам очень проста, именно она вызывает наибольшее количество вопросов у начинающих разработчиков. Поэтому, такие вопросы как для чего нужны интерфейсы, когда их применять, а когда нет, будут подробно рассмотрены в этой главе.",
            "По факту, интерфейс затрагивает сразу несколько аспектов создания программ, относящихся к проектированию, реализации, конечной сборке. Поэтому, что бы понять предназначение интерфейса, необходимо рассмотреть каждый аспект по отдельности.",
            "1. Первый аспект — реализация — предлагает рассматривать создаваемые экземпляры как социальные объекты, чья публичная часть инфраструктуры была оговорена в контракте, к коему относится интерфейс. Другими словами, интерфейс — это контракт, реализация которого гарантирует наличие оговоренных в нем членов потребителю экземпляра. Поскольку интерфейс описывает исключительно типы членов объекта (поля, свойства, сигнатуры методов), они не могут гарантировать, что сопряженная с ними логика будет соответствовать каким-либо критериям. По этому случаю была принята методология называемая контрактное программирование. Несмотря на то, что данная методология вызывает непонимание у большинства начинающих разработчиков, в действительности она очень проста. За этим таинственным термином скрываются рекомендации придерживаться устной или письменной спецификации при реализации логики, сопряженной с оговоренными в интерфейсе членами.",
            "2. Второй аспект — проектирование — предлагает проектировать объекты менее независимыми за счет отказа от конкретных типов (классов) в пользу интерфейсов. Ведь пока тип переменной или параметра представляется классовым типом, невозможно будет присвоить значение соответствующее этому типу, но не совместимое с ним. Под соответствующим подразумевается соответствие по всем обязательным признакам, но не состоящим в отношениях наследования. И хотя в TypeScript из-за реализации номинативной типизации подобной проблемы не существует, по возможности рекомендуется придерживаться классических взглядов.",
            "3. Третий аспект — сборка — вытекает из второго и предполагает уменьшение размера компилируемого пакета (bundle) за счет отказа от конкретных типов (классов). Фактически, если какой-либо объект требуется пакету лишь для выполнения операций над ним, последнему вовсе не нужно содержать определение первого. Другими словами, скомпилированный пакет не должен включать определение класса со всей его логикой только потому, что он указан в качестве типа. Для этого как нельзя лучше подходят типы, представленные интерфейсами. Хотя нельзя не упомянуть, что данная проблема не имеет никакого практического отношения к разработчикам на языке TypeScript, поскольку его (или точнее сказать JavaScript) модульная система лишена подобного недостатка.",
            "Вот эти несколько строк, описывающие оговоренные в самом начале аспекты, заключают в себе ответы на все возможные вопросы, которые только могут возникнуть относительно темы сопряженной с интерфейсами. Если ещё более доступно, то интерфейсы нужны для снижения зависимости и наложения обязательств на реализующие их классы. Интерфейсы стоит применять всегда и везде, где это возможно. Это не только повысит семантическую привлекательность кода, но и сделает его более поддерживаемым.",
            "Не лишним будет добавить, что интерфейсы являются фундаментальной составляющей идеологии как типизированных языков, так и объектно-ориентированного программирования.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Интерфейс в TypeScript. Что такое интерфейс?",
        answer: [
            "Интерфейс в TypeScript: Интерфейс в TypeScript - это синтаксическое обязательство, которому должны следовать все объекты. Он может содержать только объявление членов и отвечает за определение свойств, методов и событий. В некотором смысле, он отвечает за определение стандартной структуры, которой должны следовать производные классы.",
            "Интерфейсы — одна из ключевых фич в TypeScript, они позволяют круто типизировать классы, функции, объекты и все что только можно. Интерфейсы созданы для того чтобы давать разработчику удобный инструмент для типизации всего кода.",
            "В TypeScript интерфейс объявляется с помощью ключевого слова interface, после которого указывается идентификатор (имя), за которым следует заключенное в фигурные скобки тело содержащее описание.",
            "interface Identifier {",
            " // тело интерфейса",
            "}",
            "--",
            "TypeScript ввел новый тип данных, который определятся с помощью конструкции называемой 'interface'.",
            "Интерфейсы в TypeScript служат для именования типов данных, определения свойств и методов, которые объект должен реализовать. Другими словами, интерфейс - это определение кастомного типа данных, но без реализации. ",
            "Создавая интерфейс мы создаем именованный тип данных, где определяем свойства и методы объектов, функций или классов. В интерфейсе мы указываем какие поля, какие функции и какие вообще элементы должны присутствовать у этих объектов.",
            "Компилятор TypeScript использует интерфейс для проверки типов объектов и определяет, имеют ли они определенную структуру.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Правила именования интерфейсов.",
        answer: [
            "Существует два вида именования.",
            "1. Первый вид конвенций родом из языка Java — они предлагают именовать интерфейсы точно так же как и классы. Допускаются имена прилагательные.",
            "interface Identifier {}",
            "2. Второй вид предлагает использовать конвенции языка C#, по которым интерфейсы именуются так же как классы, но с префиксом I, что является сокращением от Interface.",
            "interface IIdentifier {}",
            "В приоритете именования интерфейсов с префиксом I.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Расширение интерфейсов (extends interface)",
        answer: [
            "Расширение интерфейсов осуществляется с помощью ключевого слова extends, после которого через запятую идет один или несколько идентификаторов расширяемых интерфейсов.",
            "interface IIdentifiable {}",
            "interface ILiving {}",
            "// интерфейсы IIdentifiable и ILiving вместе образуют логически связанную композицию, ",
            "// которую можно выделить в интерфейс IAnimal",
            "interface IAnimal extends IIdentifiable, ILiving {}",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как сделать параметр интерфейса необязательными?",
        answer: [
            "В Typescript “?” представляет необязательные параметры.",
            "Мы используем необязательные параметры, когда не обязательно, чтобы этот параметр имел значение или был указан. Даже если функция задает параметры, вы можете вызвать ее без указания каких-либо аргументов в JavaScript. В результате необязательные параметры поддерживаются по умолчанию в JaveScript, но в typescript это не так.",
            "Каждый вызов функции в TypeScript проверяется компилятором, и выдается ошибка, когда функция указывает другое количество параметров, чем количество аргументов, или когда, альтернативно, типы аргументов не соответствуют типам параметров функции. Мы используем “?” после имени параметра, чтобы сделать параметр функции необязательным. Так же, как и остальные параметры, необязательные параметры должны появляться после создания основных или требуемых параметров или ошибок.",
            "--",
            "interface ICircle {",
            " Radius: number;",
            " Color?: string;",
            "}",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как сделать все параметры интерфейса необязательными?",
        answer: [
            "Partial<T> можно использовать partial, чтобы сделать все (все) свойства необязательными..",
            "Имеем интерфейс в приложении:",
            "interface Asset {",
            " id: string;",
            " internal_id: string;",
            " usage: number;",
            "}",
            "--",
            "Используем Partial<T> тип, который TypeScript предоставляет по умолчанию.",
            "interface PostDraft {",
            "asset: Partial<Asset>;",
            "}",
            "--",
            "Теперь все свойства в asset являются необязательными, что позволит вам выполнить следующее:",
            "const postDraft: PostDraft = {",
            " asset: { id: 'some-id' }",
            "};",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое переменные TypeScript и как вы их создаете?",
        answer: [
            "Переменная - это специально названная область памяти, используемая для хранения значений. После имени переменной ставится двоеточие (:), за которым следует тип при объявлении переменной в TypeScript.",
            " - Именования переменных могут содержать буквы и цифры.",
            " - Они не должны содержать пробелы и специальные символы, кроме подчеркивания (_) и символа доллара ($",
            " - Имена переменных не должны начинаться с цифр.",
            "Перед использованием переменная должна быть объявлена. Чтобы объявить переменную, используется ключевое слово var, let, const.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Типизация функций",
        answer: [
            "Функция — блок кода, который принимает входные значения и отдает выходные значения. Часто она может ничего не принимать и что-то отдавать или наоборот принимать аргументы и ничего не отдавать вызывая коллбэки внутри себя.",
            "В целом все что нам нужно понять, это то, что у функции почти всегда есть параметры и выходное значение.",
            "Соответственно, нам нужно типизировать входные и данные и данные которые нам функция отдает (выходные).",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое модули в TypeScript? ",
        answer: [
            "В TS, как и в ECMAScript2015, любой файл, содержащий import или export верхнего уровня (глобальный), считается модулем.",
            "Модули в TypeScript представляют собой набор связанных переменных, функций, классов и интерфейсов.",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что делают модули TypeScript?",
        answer: [
            "- Определение модуля.",
            "В TS, как и в ECMAScript2015, любой файл, содержащий import или export верхнего уровня (глобальный), считается модулем.",
            "- Не модули.",
            "Спецификация JS определяет, что любой файл без import или export верхнего уровня является скриптом, а не модулем.",
            "Переменные и типы, объявленные в скрипте, являются глобальными (имеют глобальную область видимости), для объединения нескольких файлов на входе в один на выходе следует использовать либо настроку компилятора outFile, либо несколько элементов script в разметке (указанных в правильном порядке).",
            "Если у нас имеется файл, который не содержит import или export, но мы хотим, чтобы этот файл считался модулем, просто добавляем в него такую строку: export {}.",
            "",
            "- Модули в TS.",
            "Модули выполняются в собственной области видимости, а не в глобальной. Это означает, что переменные, функции, классы и т.д., объявленные в модуле, недоступны за пределами модуля до тех пор, пока они в явном виде не будут из него экспортированы. Кроме того, перед использованием экспортированных сущностей, их следует импортировать в соответствующий файл.",
            "По сути, мы не можем напрямую получить доступ к определенным модулем переменным, функциям, классам и интерфейсам извне модуля. Мы можем использовать ключевое слово export для создания модуля, а ключевое слово import - для включения модуля в другой модуль.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что отличает внутренний модуль от внешнего модуля? ",
        answer: [
            "Внутренний модуль.",
            "Внутренние модули содержат набор классов, интерфейсов, функций и переменных, которые вы можете экспортировать в другие модули. Внутренние модули были особенностью предыдущей итерации Typescript, и они группируют интерфейсы, функции, переменные и классы. Вы можете использовать ModuleDeclarations для определения названия и тела внутренних модулей.",
            "Внешний модуль.",
            "Вы можете скрыть внутренние инструкции определений модулей с помощью внешних модулей, позволяя видеть только методы и аргументы, связанные с определенной переменной.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как сделать так, чтобы переменные, функции, методы, классы, определенные в модуле, были доступны вне модуля?  ",
        answer: [
            "Необходимо сделать именованный export, если переменных, функций, методов, классов испольуемых вне модуля много.",
            "Если необходимо экспортировать только одно значение, то используем export default.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое архитектура Model-View-Controller (MVC)?",
        answer: [
            "Основным принципом MVC является разделение программы на три части:",
            "1. Модель, которая служит основой для базы данных.",
            "2. Контроллер, который регулирует взаимодействие между представлением и моделью.",
            "3. Представление (пользовательский интерфейс и презентация).",
            "Модель.",
            "Модели используются для описания бизнес-логики и формы данных. Помимо доступа к состояниям объектной модели и их хранения в базе данных, она сохраняет данные приложения. Он отвечает на запросы пользователей о считывании данных и также изменяет данные. При получении или публикации данных Модель взаимодействует с базой данных, получает запросы, связанные с базой данных, обрабатывает их, а затем отправляет результаты обратно пользователю через браузер.",
            "Вид.",
            "View - это пользовательский интерфейс, позволяющий пользователям получать доступ к ресурсам программы и отправлять запросы на сервер или серверную часть приложения. Как правило, пользователь может отправить запрос на доступ к определенным ресурсам, таким как определенная веб-страница, с помощью веб-браузера или мобильного приложения. Вы можете использовать инструменты и фреймворки, такие как Vue или React, или написать представление полностью в HTML.",
            "Контролер.",
            "Итак, что происходит, когда вы хотите запросить данные и получить ответ? Вам понадобится соответствующая бизнес-логика - алгоритм, который получает запрос пользователя, проверяет его или отправляет другому компоненту. Эта ответственность ложится на контролеров.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Область действия переменной TypeScript",
        answer: [
            "Область видимости переменной указывает, где определена переменная. Доступность переменной в программе определяется ее областью действия. Переменные TypeScript могут быть следующих областей −",
            "1. Глобальная область видимости : глобальные переменные объявляются вне программных конструкций. К этим переменным можно получить доступ из любого места вашего кода.",
            "2. Область действия функции/класса: переменные, определенные в функции или классе, могут использоваться в любом месте этой области.",
            "3. Локальная область/блок кода : переменные, определенные в локальной области. Локальные переменные, как следует из названия, объявляются в конструкциях, таких как методы, циклы и т.д. Локальные переменные доступны только внутри конструкции, в которой они объявлены.",
            "---",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое ключевое слово “declare” в Typescript?",
        answer: [
            "Ключевое слово declare в TypeScript используется для внешнего объявления переменных или методов. Внешние объявления похожи на ключевое слово импорта. Которое сообщает компилятору, что исходный код существует в другом файле. Мы используем внешние объявления в TypeScript для использования сторонних библиотек JavaScript, jQuery, Node и т.д. ключевое слово declare напрямую интегрирует эти библиотеки в наш код и уменьшает вероятность ошибки в нашем коде TypeScript.",
            "Мы используем ключевое слово declare только в окружающем файле для использования метода libraries и переменных.",
            "Синтаксис:",
            "declare var Variable_Name;",
            "declare module Name_of_Module{// Body of module };",
            "Пример: Теперь давайте рассмотрим один пример: у нас есть один файл, который содержит некоторые полезные переменные, но файл написан на JavaScript. Таким образом, мы не можем сказать, что нам нужно написать некоторый код JavaScript в TypeScript, это отнимает столько времени, что нам приходится писать тот же код в TypeScript, но мы объявили ключевые слова, которые предоставляют функциональность для использования той же переменной в конце кода.",
            "Давайте предположим, что у нас есть сторонний код JavaScript, в котором есть переменная, содержащая значение некоторой переменной, но у нас нет значения, но с помощью ключевого слова declaring мы можем использовать значение переменной в нашем коде.",
            "Сторонний код:",
            "var pi_1 = 3.1415926535 ;",
            "var pi_2 = 3.14159265358979323846 ;",
            "Мы хотим использовать эту переменную в нашем коде, чтобы мы могли использовать их для объявления ключевого слова с тем же именем, и TypeScript не выдаст ошибку.",
            "Код TypeScript:",
            "declare var pi_1 : any ;",
            "console.log('Value of pi is :',pi_1) // Value of pi is: 3.1415926535",
            "--",
            "--",
            "Ключевое слово “declare” информирует компилятор о том, что указанный объект уже существует в будущем коде и на него может ссылаться другой код. Это также используется для указания на то, что утверждение не требует компиляции в какой-либо JavaScript.",
            "- Общий Вариант использования: ",
            "Вы добавляете ссылку на свою веб-страницу в файл JavaScript, о котором компилятор ничего не знает. возможно, это скрипт, поступающий из какого-то другого домена, например 'foo.com . при оценке скрипт создаст объект с некоторыми полезными методами API и присвоит ему идентификатор 'fooSdk' в глобальной области видимости.",
            "Вы хотите, чтобы ваш код TypeScript мог вызывать fooSdk.doSomething(), но поскольку ваш компилятор не знает, fooSdk что переменная существует, вы получите ошибку компиляции.",
            "Затем вы используете declare ключевое слово как способ сообщить компилятору: 'поверьте мне, эта переменная существует и имеет этот тип'. Компилятор будет использовать этот оператор для статической проверки другого кода, но не будет перекомпилировать его в какой-либо JavaScript в выходных данных.",
            "declare const fooSdk = { doSomething: () => boolean }",
            "-",
            "Более новая версия Typescript требует немного другого синтаксиса:",
            "declare const fooSdk : { doSomething: () => boolean }",
            "В том же духе вы можете добавить ключевое слово declare в свойства класса, чтобы указать компилятору не создавать какой-либо код, который создал бы это свойство, предполагая, что у вас есть свой собственный код, который создал бы его, о котором компилятор не знает или не понимает.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Когда нужно использовать ключевое слово «declare»?",
        answer: [
            "При использовании библиотеки JavaScript, не объявленной в вашем TypeScript-проекте.",
            "Пример:",
            "declare const libraryName; ",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Расширение .tsx",
        answer: [
            "В основе библиотеки продвинутого рендера React лежит компонентный подход, для улучшения которого, стандартный синтаксис JavaScript был расширен XML-подобным синтаксисом. Таким образом свет увидело новое расширение .jsx.",
            "Из-за высокой популярности React данное расширение получило свое типизированное представление в виде .tsx.",
            "Для того, что бы компилятор tsc смог компилировать .tsx синтаксис, необходимо установить его опцию --jsx в одно из значений - “react” для вэб и настольных, а также “react-native” для мобильных приложений. По умолчанию выставлено значение “preserve”.",
            "// @filename: tsconfig.json",
            "{",
            "'compilerOptions': {",
            "'jsx': 'react'",
            "}",
            "}",
            "Кроме того, помимо самого react, необходимо установить его декларации.",
            "npm i -D @types/react @types/react-dom",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое утверждения типа в TypeScript?",
        answer: [
            "В Typescript утверждение типа - это метод, который информирует компилятор о типе переменной. Утверждение типа похоже на приведение к типу, но оно не восстанавливает код. Вы можете использовать утверждение типа, чтобы указать тип значения и сказать компилятору не выводить его. Когда мы хотим изменить переменную с одного типа на другой, например, any на number и т.д., Мы используем утверждение типа.",
            "Мы можем либо использовать оператор угловые скобки  ‘<>’ , либо ключевое слово ‘as’ для выполнения утверждения типа. Когда мы переносим код из typescript на другой язык, в игру вступает утверждение типа. Поддержка во время выполнения поставляется с приведением типов, тогда как утверждение типа не влияет на время выполнения. Он используется компилятором.",
            "--",
            "Пример 1. Введите утверждение, используя синтаксис.",
            "В этом примере мы присваиваем строку ‘geeksforgeeks’ переменной неизвестного типа. Далее мы присваиваем значение строки другой переменной и вычисляем длину строки. В приведенном ниже коде мы утверждали, что str имеет тип number, используя ключевое слово “as”.",
            "let str: unknown = 'geeksforgeeks';",
            "console.log( str ); // geeksforgeeks",
            "let len: number = ( str as string ).length;",
            "console.log( len ); // 13",
            "--",
            "Пример 2. Введите утверждение, используя синтаксис ‘<>’ угловых скобок",
            "Этот пример похож на предыдущий, мы присваиваем число переменной типа any, а затем присваиваем значение другой переменной, и мы утверждаем, что переменная num имеет тип “Число”. Мы использовали <> угловые скобки вместо ключевых слов.",
            "let num: any = 77;",
            "// Преобразование из any в number",
            "let num1 = <Number> num;",
            "console.log( num1 ); // 77",
            "console.log( typeof num1 ); // number",
            "--",
            "Пример 3. Утверждение типа для объектов",
            "Иногда мы можем столкнуться с обстоятельством, при котором объект определяется без каких-либо свойств. В результате этого компилятор выдает ошибку. Однако мы можем предотвратить эту проблему, используя утверждение типа. С помощью следующего примера мы можем это понять.",
            "interface details {}",
            "details.first_name = 'Sarah';",
            "details.last_name = 'jane'; // error TS2693: 'details' относится только к типу, но здесь используется как значение.",
            "--",
            "После определения параметров компилятор не выдает ошибку. Компилятор выдает ошибку в предыдущем примере, поскольку он не может найти какие-либо свойства внутри объекта. Утверждение типа помогает нам устранять такие ошибки. Мы использовали утверждение типа для деталей.",
            "interface details {",
            "first_name: string;",
            "last_name: string;",
            "}",
            "let person_1 = <details>{};",
            "person_1.first_name = 'Sarah';",
            "person_1.last_name = 'jane';",
            "console.log(person_1); // { first_name: 'Sarah', last_name: 'jane' }",
            "--",
            "Type assertion (утверждение типа) представляет модель преобразования значения переменной к определенному типу.",
            "Утверждение типа в TypeScript работает так же, как преобразование типов в JavaScript, но без проверки типов или реструктуризации данных. Утверждение типа не влияет на время выполнения и используется исключительно компилятором.",
            "Утверждение типа, по сути, представляет собой мягкую версию преобразования (приведения) типов, которая предлагает компилятору рассматривать переменную как определенный тип, но не принудительно вводит ее в эту форму, если она находится в другой форме.",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Операторы ‘as’ и ‘<>’. Type assertion (утверждение типа) - преобразование к типу.",
        answer: [
            "Операторы ‘as’ и ‘<>’ - это утверждение типа в TypeScript, которое указывает компилятору рассматривать объект как другой тип, отличный от того типа, к которому компилятор относит объект.",
            "Type assertion (утверждение типа) представляет модель преобразования значения переменной к определенному типу.",
            "Предположим, у вас есть два типа: первый и второй. Вы пишете метод, и метод точно не знает, к какому типу будет принадлежать ваш объект. Это может быть тип первый или второй.",
            "Обычно в некоторых ситуациях одна переменная может представлять какой-то широкий тип, например, any или union, которые по факту допускают значения различных типов. Однако при этом нам надо использовать переменную как значение строго определенного типа. И в этом случае мы можем привести к этому типу.",
            "В качестве примера возьмем простейшую задачу: есть переменная значением строкового типа account = '123'. Для математических вычислений, нам необходимо преобразовать тип из строкового в числовой. ",
            "Есть разные способы для решения этой проблемы, и одним из них является приведение типов с помощью type assertion.",
            "Есть две формы приведения: ",
            "1. Использование угловых скобок <>. Перед значением, в угловых скобках, указывается тип, к которому надо выполнить приведение.",
            "let account = '123';",
            "let numberAccount= <number>account;",
            "--",
            "2. Использование оператора ‘as’ , после которого указывается тип, к которому надо выполнить преобразование:",
            "let account= '123';",
            "let numberAccount= account as number;",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Обобщённые типы (generics) в TypeScript.",
        answer: [
            "В документации TypeScript приводится следующее определение: 'дженерики — это возможность создавать компоненты, работающие не только с одним, а с несколькими типами данных'.",
            "Основная идея состоит в том, что дженерики позволяют нам создавать некие повторно используемые компоненты, работающие с различными типами передаваемых им данных.",
            "Дженерики — это всего лишь способ передать типы в компонент. ",
            "Дженерики (generic) помогают писать универсальный, переиспользуемый код, а также в некоторых случаях позволяют отказаться от any. Главная задача дженериков — помочь разработчику писать код, который одинаково будет работать со значениями разных типов.",
            "Пример: ",
            "Представим, что нам с сервера приходит описание платежа из истории в формате:",
            "type PaymentInfo = {",
            "id: string;",
            "amount: number;",
            "currency: string; // currencyArr = '₽' | '€' | '$';",
            "}",
            "--",
            "Потом кто-то разработал новый сервис, который отдает информацию о переводах. И он стал передавать информацию в следующем виде:",
            "type NewPaymentInfo = {",
            "id: string;",
            "amount: number;",
            "currency: number; // код валюты // currencyArr = 643 | 978 | 840;",
            "}",
            "--",
            "Теперь нам приходит код валюты, а не ее буквенное обозначение. При этом на старые записи в истории мы все еще получаем строковый код. Чтобы не описывать разные типы и не создавать путаницу, можно объединить их в один обобщенный тип — дженерик:",
            "type PaymentInfo<T> = { // T — параметр дженерика",
            "id: string;",
            "amount: number;",
            "currency: T; // «настраиваем» тип поля currency",
            "}",
            "const paymentInfo: PaymentInfo<string> = // …",
            "--",
            "Можно указать типы параметров дженерика по умолчанию. Если не передать в такой дженерик параметр, то TypeScript возьмёт значение по умолчанию:",
            "type PaymentInfo<T = string> = { … } // T — по умолчанию тип string",
            "const paymentInfo: PaymentInfo = // … тип переменной — PaymentInfo<string>",
            "Почему T? Так сложилось, что параметры дженериков именуют одной буквой (T означает Type), но вы без проблем можете написать не T, а Currency:",
            "--",
            "Интерфейсы тоже могут быть обобщёнными:",
            "interface PaymentInfo<T> {",
            "id: string;",
            "amount: number;",
            "currency: T;",
            "}",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое декораторы и к чему их можно применить? ",
        answer: [
            "Декоратор — это особый тип объявления, который позволяет изменять классы или члены классов одновременно, помечая их аннотацией @<name>. Каждый декоратор должен ссылаться на функцию, которая будет оцениваться во время выполнения.",
            "Например, декоратор @sealed будет соответствовать функции sealed. Все, что помечено, @sealed будет использоваться для оценки sealed функции.",
            "function sealed(target) {",
            "// do something with 'target' ..",
            "",
            "",
            "На текущий момент декораторы являются экпериментальной функциональностью языка TypeScript",
            "-",
            "К ним можно прикрепить:",
            "Объявления классов",
            "Методы",
            "Аксессуар",
            "Характеристики",
            "Параметры",
            "По умолчанию декораторы не включены. Чтобы включить их, вы должны отредактировать поле experimentalDecorators в параметрах компилятора в файле tsconfig.json или в командной строке.",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое перегрузка функции в TypeScript?",
        answer: [
            "Перегрузка функции - это способ определить функцию с несколькими вариантами типов и реализаций. Перегруженная функция может иметь несколько определений, которые отличаются по количеству и типу параметров.",
            "Перегрузка - это возможность указать несколько типов (несколько сигнатур) для одной и той же функции. Компилятор TypeScript будет сопоставлять типы переданных параметров с перегрузками функции и, если у функции не будет подходящего типа, выдаст ошибку.",
            "Перегрузка — неоднозначный инструмент, вокруг которого много разговоров.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как добиться перегрузки функций в TypeScript?",
        answer: [
            "Чтобы перегрузить функцию в TypeScript, просто создайте две функции с одинаковыми именами, но с разными типами аргументов/возвратов. Обе функции должны принимать одинаковое количество аргументов. Это неотъемлемая часть полиморфизма в TypeScript.",
            "Например, вы можете создать add- функцию, которая суммирует два аргумента, если они являются числами, и объединяет их, если они являются строками:",
            "--",
            "function add( a: string, b: string ): string;",
            "function add( a: number, b: number ): number;",
            "function add( a: any, b: any ): any {",
            " return a + b;",
            "}",
            "--",
            "Сделаем вызов:",
            "add( 'Hello ', 'Steve' ); // returns 'Hello Steve' ",
            "add( 10, 20 ); // returns 30 ",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как перегрузить функцию?",
        answer: [
            "Надо использовать то же имя функции над оригинальной функцией без скобок {} и изменить число и типы аргументов и/или тип возвращаемого значения.",
            "Пример:",
            "function add(x: string, y: string): string;",
            "function add(x: number, y: number): number {",
            "return x + y;",
            "} ",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как использовать миксины (примеси) в TypeScript.",
        answer: [
            "Миксины — это, по сути, наследование, которое работает в противоположном направлении. Примеси позволяют вам создавать новые классы, комбинируя более простые частичные установки классов из предыдущих классов.",
            "Вместо того, чтобы класс Aрасширял класс B, чтобы получить его функциональность, класс B берет класс A и возвращает новый класс с дополнительной функциональностью.",
            "Примесь – объект, содержащий методы и свойства для реализации конкретного функционала. Функциональность миксинов (mixins) частично позволяет унаследовать свойства и методы сразу двух и более классов, тем самым избавившись от дублирования в коде.",
            "TypeScript, как и многие объектно-ориентированные языки, как, например, Java или C#, не позволяет использовать напрямую множественное наследование. Мы можем реализовать множество интерфейсов в классе, но унаследовать его можем только от одного класса. Однако функциональность миксинов (mixins) частично позволяют унаследовать свойства и методы сразу двух и более классов.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как проверить на null или undefined?",
        answer: [
            "Undefined - переменная не определена. Ей не присвоено какое-либо значение после объявления.",
            "Null относится к значению, которое либо пусто, либо не существует. Null означает отсутствие значения.  Чтобы сделать переменную null, мы должны присвоить ей значение null, поскольку по умолчанию в typescript неназначенные значения называются неопределенными.",
            "--",
            "Мы можем использовать typeof или ‘==’ или ‘===’, чтобы проверить, является ли переменная null или undefined в typescript.",
            "Рекомендуется проверять == null как на undefined, так и null.",
            "--",
            "message = undefined;",
            "getMessage() {",
            "if (this.message !== null && this.message !== undefined) {",
            "return 'default message';",
            "}",
            "return this.message;",
            "}",
            "--",
            "Также оператор нулевого слияния ‘??’ помогает проверить, является ли переменная null или undefined. С оператором ?? вместо длинной проверки:",
            "message = undefined;",
            "getMessage() {",
            "return this.message ?? 'Default message';",
            "}",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое геттеры/сеттеры в TypeScript? Как вы их используете? ",
        answer: [
            "Геттеры и сеттеры — это специальные типы методов, которые помогают вам делегировать различные уровни доступа к закрытым переменным в зависимости от потребностей программы.",
            "Геттеры позволяют ссылаться на значение, но не могут его редактировать. Сеттеры позволяют вам изменить значение переменной, но не видеть ее текущее значение. Они необходимы для достижения инкапсуляции.",
            "Например, новый работодатель может иметь право на getколичество сотрудников в компании, но не имеет разрешения на setколичество сотрудников.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как преобразовать строку в число с помощью Typescript?",
        answer: [
            "Как и в JavaScript, вы можете использовать функции parseInt или parseFloat для преобразования строки в целое число или число с плавающей запятой соответственно. Вы также можете использовать унарный оператор + для преобразования строки в наиболее подходящий числовой тип: «3» становится целым числом, 3а «3.14» становится числом с плавающей запятой 3.14.",
            "var x = '32';",
            "var y: number = +x;",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое файл .map и зачем/как его использовать?",
        answer: [
            "Файл map - это исходная карта, которая показывает, как исходный код TypeScript был интерпретирован в пригодный для использования код JavaScript. Они помогают упростить отладку, поскольку вы можете отловить любое странное поведение компилятора. Инструменты отладки также могут использовать эти файлы, чтобы вы могли редактировать базовый TypeScript, а не создаваемый файл JavaScript.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Какие режимы JSX поддерживает TypeScript?",
        answer: [
            "TypeScript имеет встроенную поддержку preserve, reactи react-native.",
            "- preserve сохраняет JSX нетронутым для использования в последующем преобразовании.",
            "- react не проходит преобразование JSX, а вместо этого генерирует react.createElement и выводит как .js расширение файла.",
            "- react-native сочетает в себе preserve и react в том, что он поддерживает все JSX и выходные данные в качестве .js расширения.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как компилировать файл TypeScript?",
        answer: [
            "Вам нужно вызвать компилятор TypeScript tsc для компиляции файла. Вам потребуется установить компилятор TypeScript, что вы можете сделать с помощью npm.",
            "npm install -g typescript",
            "tsc <TypeScript File Name>",
            "---",
            "Вообще, это  плохая затея. По мне, лучше заново создать проект с TS и переписать его. Если добавить TS в существующий проект, то вылезет миллион ошибок, которые не возможно отследить.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Объясните параметры Rest... и правила объявления параметров Rest...",
        answer: [
            "Параметры Rest:",
            "- Остаточные параметры позволяют передавать в функцию ноль или более аргументов указанного типа. Это полезно, когда вы не уверены, сколько параметров получит функция. Все аргументы после символа остатка ... будут храниться в массиве.",
            "- у вас может быть только 1 остаточный параметр для каждой функции.",
            "- Остаточный параметр должен быть последним в определении параметра.",
            "- Поскольку здесь речь идет о TypeScript, поэтому тип параметра rest имеет тип массива (далее массив может быть строковым типом данных или числовым типом данных или чем угодно).",
            "--",
            "Синтаксис: Ниже приведен синтаксис параметров rest, предоставленный в TypeScript.",
            "function function_name (...rest_parameter_name : type[]) { }",
            "Здесь эти “...” (тройные точки) представляют синтаксис параметра rest, за которым следует имя параметра rest, за которым следует тип этого параметра rest (должен иметь тип данных массива).",
            "--",
            "Аргументы Rest:",
            "- Это аргументы, которые мы передаем при объединении двух типов данных (предположим, конкатенации двух массивов) с использованием одного и того же “...” (тройные точки).",
            "- Эти типы аргументов обычно используются для слияния или конкатенации или для любых других операционных целей.",
            "--",
            "Синтаксис: Ниже приведен синтаксис использования аргументов Rest в TypeScript (объясняется на примере).",
            "let array_1 : number[] = [1 , 2 , 3];",
            "let array_2 : number[] = [5 , 6, 7];",
            "array_1.push(array_2);",
            "--",
            " Например:",
            "function Greet(greeting: string, ...names: string[]) {",
            "return greeting + ' ' + names.join(', ') + '!';",
            "}",
            "-",
            "Greet('Hello', 'Steve', 'Bill'); // returns 'Hello Steve, Bill!'",
            "Greet('Hello');// returns 'Hello !'",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое директивы с тройной косой чертой? ",
        answer: [
            "Директивы с тройной косой чертой - это однострочные комментарии, содержащие тег XML для использования в качестве директив компилятора.",
            "Каждая директива указывает, что загружать в процессе компиляции. Директивы с тройной косой чертой работают только в верхней части своего файла и будут рассматриваться как обычные комментарии в любом другом месте файла.",
            "--",
            "Директивы с тройной косой чертой — это однострочные комментарии, содержащие тег XML для использования в качестве директив компилятора. Каждая директива указывает, что загружать в процессе компиляции. Директивы с тройной косой чертой работают только в начале своего файла и будут рассматриваться как обычные комментарии в любом другом месте файла.",
            "- /// <reference path=''...'' /> является наиболее распространенной директивой и определяет зависимость между файлами.",
            "- /// <reference types=''...'' /> аналогичен, pathно определяет зависимость для пакета.",
            "- /// <reference lib=''...'' /> позволяет явно включать встроенный lib файл",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Для чего нужен тип «Omit»?",
        answer: [
            "Это новый тип, в котором можно указать свойства, которые будут исключены из исходного типа.",
            "Omit— это форма служебного типа, которая облегчает преобразование общих типов. Позволяет нам создать новый тип, используя какой-то исходный, уже определённый Type, исключив из него Keys, который будет пропущен в новом типе:",
            "Omit<Type, Keys>",
            "--",
            "Пример 1:",
            "type Person = { name: string; age: number; location: string; };",
            "type QuantumPerson = Omit<Person, 'location'>; // в новом типе пропускаем location: string;",
            "QuantumPerson = { name: string; age: number; }; // что в итоге получаем.",
            "--",
            "Пример 2.",
            "Исходный интерфейс:",
            "interface Todo {",
            "- title: string;",
            "- description: string;",
            "- completed: boolean;",
            "- createdAt: number;",
            "}",
            "--",
            "Ниже мы указываем, что создаём новый тип TodoPreview из исходного, путём исключения из него свойства 'description'",
            "type TodoPreview = Omit<Todo, 'description'>;",
            "Таким образом мы создадим новый тип TodoPreview без свойства 'description': ",
            "type TodoPreview = {",
            " title: string;",
            " completed: boolean;",
            " createdAt: number;",
            "}",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Как автоматически получить файлы declaration?",
        answer: [
            "Установить опцию компилятора на true в файле tsconfig.json",
            "Пример:",
            "{",
            "'compilerOptions': {",
            "...",
            "'declaration': true,",
            "}",
            "}",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Разница между Type и Interface в TypeScript",
        answer: [
            "Смотри на ютубе.",
            "https://www.youtube.com/watch?v=hGdx0hpZsvs&list=PLdTPrJkdrLGGgSnXMsO-Rix3MTuySb_mF&index=2",
            "1. Interface всегда для описания объектов и функций, а Type, как для объектов - функций, так и для других различных сущностей. Функции в JavaScript являются объектами, разница лишь в том, их можно вызвать.",
            "Если мы рассмотрим вариант использования этих сущностей для объектов, то в ряде случаев они взаимно заменяемы:",
            "interface Interface1 {",
            "name: string;",
            "}",
            "-",
            "type Type1 = {",
            "name: string;",
            "}",
            "В данном случае нет особой разницы, что использовать. Оба эти варианта подходят.",
            "-",
            "Однако, если мы будем говорить не об объектах, а о других сущностях, то тут не всё так однозначно. Для таких случаев мы должны использовать Type. Вот пара примеров:",
            "type Type2 = (prop: string) => string; // функция",
            "type Type3 = string; // примитив ",
            "--",
            "Рассмотрим описание функции, которая принимает и возвращает number через тип:",
            "type SumB = (a: number, b: number) => number; // описание",
            "const sum: SumB = ( a, b ) => a + b ; // функция",
            "То же, но через интерфейс: ",
            "interface SumA {",
            " (a: number, b: number ) => number",
            "}",
            "const sum: SumA = ( a, b ) => a + b ;",
            "",
            "2. Расширение (extends) interface. Для interface существует такая функциональность, как расширение. interface может наследоваться как от interface, так и от типа.",
            "Type не связан с ООП, ни о каком наследовании, расширении не идёт речь.",
            "Представим простой interface Animal, который будет обозначать животного:",
            "interface Animal {",
            "name: string;",
            "}",
            "У объекта, который реализует этот interface будет одно свойство - name.",
            "-",
            "Теперь рассмотрим расширение данного interface.",
            "interface Dog extends Animal {",
            "bark: () => void;",
            "}",
            "В данном случае мы создаём Interface Dog, который создаёт более конкретный тип животных - собак. И в нём мы реализуем метод bark - лай. Поскольку не все животные лают, а только собаки, то этот метод - специфическое свойство.",
            "-",
            "И давайте используем этот interface для создания объекта:",
            "const dog: Dog = {",
            "name: 'Бобик',",
            "bark: () => console.log('Гав')",
            "}",
            "Как вы увидели из данного примера, interface имеет возможность создания повых interface на основе предыдущих.",
            "--",
            "3. Реализация (implements) interface",
            "Поскольку interface - это сущность из ООП, то мы можем использовать её по назначению. Вот пример реализации:",
            "4. С помощью типа можно сделать псевдоним для примитива. Интерфейс не позволяет такого.",
            "type UniqueId = string;",
            "Этот псевдоним можно использовать и в типах и в интерфейсах:",
            "interface Use {",
            "id: UniqueId;",
            "};",
            "Ещё раз, псевдоним примитива можно сделать только при помощи типа, интерфейс тут не поможет.",
            "Но.... Если этот алиас не для примитива, а для массива, то мы можем здесь использовать интерфейс.",
            "type NamesA = string[];",
            "interface NamesB {",
            " [ key: number ]: string // плохая запись через интерфейс, непонятная...",
            "}",
            "5. Так же, через интерфейс невозможно сделать описание кортежа. ",
            "Кортеж, это массив определённого размера, длина которого не изменяется и выступает как константа в мире массивов.",
            "type State = [ number, (n: number)=> void ]",
            "const s: State = [ 123, (n) => {} ]",
            "6. Так же мы можем создать тип, который будет ",
            "type A = {",
            " age: number;",
            "}",
            "-",
            "type B = {",
            " name: string;",
            "}",
            "-",
            "type C = A | B;",
            "Это значит, что можно создать объект с полем age: 22 или name: 's', или с обоими полями вместе. И тайпскрипт не будет ругаться на это.",
            "const obj: C = {",
            "age: 22,",
            "name: 's',",
            "}",
            "Итнерфейс для такого объекта написать невозможно, только псевдоним типа.",
            "--",
            "7. Невозможно написать дин и тот же тип несколько раз:",
            "type A = {",
            " age: number;",
            "}",
            "-",
            "type A = {} // error",
            "А интерфейсы позволяют",
            "interface B {",
            " name: string",
            "}",
            "-",
            "interface B {",
            "age: number",
            "}",
            "И далее при создании объекта, typescript скажет, что нужны поля и  name: string и age: number",
            "---------------",
            "8. Так когда же использовать интерфейсы, а когда типы?",
            "Интерфейсы мы используем при описании доменной логики нашего приложения, а так же, например для объектов, которые приходят к нам по API. Функционального компонента в реакте.",
            "А типы мы используем для взаимодействия с этими интерфейсами, например у нас может быть интерфейс Nullable, это дженерик, который принимает тип. Он может быть null или undefined. И далее мы можем создавать типы или переменные на основе этих объектов, интерфесов и типов.",
            "interface User {",
            " name: string;",
            " age: number;",
            "}",
            "type Nullable<T> = T | null | undefined;",
            "Таким образом, интерфейс у нас будет отвечать за логику приложения, а типы будут описывать поведенческие моменты.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Разница между типом и интерфейсом в TypeScript: характеристики Type",
        answer: [
            "1. Это набор типов данных.",
            "2. Типы более гибкие.",
            "3. Для создания нового типа используется ключевое слово “type”.",
            "4. Он поддерживает создание нового имени для типа.",
            "5. У него меньше сравнительно меньших возможностей.",
            "6. Он не поддерживает использование объекта.",
            "7. Нельзя использовать несколько объединенных объявлений.",
            "8. Два типа с одинаковым именем вызывают исключение.",
            "9. У него нет целей реализации.",
            "10. Он не поддерживает функцию реализации или расширения типов объединения в классе.",
            "11. Можно создать тип пересечения, объединив несколько типов в один тип.",
            "12. Он также используется для таких типов, как примитивы, объединения и кортежи.",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Разница между типом и интерфейсом в TypeScript: характеристики Interface ",
        answer: [
            "1. Это форма синтаксиса.",
            "2. Интерфейс менее гибкий по сравнению с типами typescript.",
            "3. Для объявления интерфейса используется ключевое слово “interface”.",
            "4. Он предоставляет способ определения сущностей.",
            "5. Он обладает сравнительно большими возможностями.",
            "6. Он поддерживает использование объекта.",
            "7. Можно использовать несколько объединенных объявлений.",
            "8. Два интерфейса с одинаковым именем объединяются.",
            "9. У него есть цель реализации.",
            "10. Он поддерживает реализацию и функцию расширения в typescript.",
            "11. Невозможно создать какой-либо новый интерфейс пересечения.",
            "12. Его нельзя использовать с другими типами объявлений.",
            "Вывод- Хотя оба типа Typescript и интерфейс отличаются некоторыми функциями, но оба они почти похожи, поэтому нельзя перестать использовать одно поверх другого. Разработчик может выбрать, какой typescript он / она хочет использовать.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Множественное наследование",
        answer: ["Если мы хотим унаследоваться у двух классов, то у нас возникает множественное наследование. ", ""],
        isParagraphBefore: true
    },
    {
        heading: "Когда использовать наследование, а когда generic в TypeScript",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "Объектно-ориентированное программирование (ООП).",
        answer: [
            "Объектно-ориентированное программирование (ООП) — подход, при котором разработчик создает систему объектов и классов. ",
            "Объектно-ориентированное программирование – это подход, при котором вся программа рассматривается как набор взаимодействующих друг с другом объектов. При этом нам важно знать их характеристики. У каждого объекта в системе есть свойства и поведение, как и у любого реального объекта.",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое скриптовый язык программирования?",
        answer: [
            "Скриптовый язык (англ. scripting language, также называют язык сценариев) - язык программирования, разработанный для записи «сценариев», последовательностей операций, которые пользователь может выполнять на компьютере.",
            "Сценарии всегда интерпретируются, а не компилируются.",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Литеральные типы",
        answer: [
            "Сегодня в TypeScript доступны три набора литеральных типов: строки, числа и булевы. Используя литеральные типы, можно задать точное, конкретное значение, которое должна иметь строка, число или булева величина.",
            "Литеральные типы в Typescript - это более конкретные типы строк, чисел и логических значений. ",
            "1. Объявим переменную C, которая будет равна 'test':  ",
            "- let C = 'test'; // test у нас имеет тип string. ",
            "Но мы можем сказать, что переменная С может быть только test:",
            "- let C: 'test' = 'test'; // переменная С может быть только test",
            "Это и есть литеральный тип. Мы установили, что переменная С может иметь только одно значение: 'test'. Мы не можем написать teste, testa. Ничего другого, только test. ",
            "-*-",
            "2. Объявим тип экшен, который может принимать либо 'up' либо 'down'. С помощью экшена мы можем перемещаться либо вверх, либо вниз. Теперь видно, что экшен может быть всего 2-х типов.",
            "- type actionType = 'up' | 'down' ",
            "Создадим функцию, которая принимает в себя (action: actionType). И, когда мы будем делать switch по этому экшену, мы увидим, что case может быть только либо 'up', либо 'down'. То есть, мы ограничиваем наборы действий по этому экшену. Немного напоминает enum. ",
            "function performAction(action: actionType) {",
            "- switch (action) {",
            "- - case 'up': ... ",
            "- - case 'down': ... ",
            "-}",
            "}",
            "То есть, фактически, мы ограничили строковый выход этого типа или строковый вход этого типа конкретными значениями. Это и есть литеральные значения.",
            "-*-",
            "3. То же самое мы можем сказать, что данная функция будет возвращать литеральный тип нумерический. Это означает, что она вернёт нам либо -1 либо 1. ",
            "function performAction(action: actionType): -1 | 1 {",
            " switch (action) {",
            " - case 'up': ",
            " - - - return -1 ",
            " - case 'down': ",
            " - - - return 1 ",
            "}",
            "}",
            "Тем самым мы обозначили, что принимаем литеральный строковый тип action, а возвращаем литеральный нумерический тип: только -1 либо 1.",
            "-*-",
            "4. Литеральные типы могут быть скомбинированны с обычными интерфейсами.",
            "function performAction(action: actionType | ComplexAction) {",
            " switch (action) {",
            " - case 'up': ",
            " - - - return -1 ",
            " - case 'down': ",
            " - - - return 1 ",
            "}",
            "}",
            "-",
            "interface ComplexAction {",
            "s: string;",
            "};",
            "Литеральные типы немного напоминают enum.",
            "-*-",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "Что такое keyof typeof в TypeScript.",
        answer: [
            "1. Литеральные типы в Typescript - это более конкретные типы строк, чисел и логических значений.",
            "type Role = 'Admin'; // здесь тип не строка, а Admin. Присвоить перменной с типом Role мы можем только значение Admin. Любое другое значение вызовет ошибку.",
            "- const currentRole: Role = 'Admin'; ",
            "console.log(currentRole); // Admin",
            "- const currentRole: Role = 'Amur'; ",
            "console.log(currentRole); // Error",
            "-*-",
            "2. Так же в Typescript существуют объединения литеральных типов. Например, в типе Roles могут быть админ, модератор или юзер: ",
            "type Roles = 'Admin' | 'Moderator' | 'User' ; ",
            "И тогда значением переменной currentRole с типом Roles может быть одно из этих значений, то есть 'Admin', 'Moderator' или 'User' .",
            "-*-",
            "3. Оператор keyof используется для получения ключей любого типа.",
            "Допустим у нас есть интерфейс: ",
            "interface User {",
            "- name: string;",
            "- age: number;",
            "}",
            "Далее мы создадим тип UserKeys, используя оператор keyof над типом User: ",
            "type UserKeys = keyof User;",
            "Далее, объявив переменную prop с типом UserKeys,",
            " - - let prop: UserKeys; // name, age",
            "мы увидим, что записать в переменную можно только name или age. Никакое другое значение туда не подходит. Так как мы явно запросили ключи интерфейса User и переменная prop ограничена ими. Оператор keyof возвращает нам новый тип, который является объединением литеральных типов. По сути это аналог типа:",
            "type UserKeys = 'name' | 'age'. ",
            "Только мы этот юнион прямо не прописываем, а генерим на лету с помощью тайпскрипт-оператора keyof. ",
            "-*-",
            "4. keyof typeof ",
            "const message = {",
            "- id: 1,",
            "- text: 'JavaScript', ",
            "}",
            "const t = typeof message",
            "console.log(t); // object",
            "Однако, если использовать typeof с типом (typeof message), то тайпскрипт сделает запрос: какой тип объекта message и сохранит его в тип MessageType. Расспознает его, и укажет что id у нас будет типа number, а text будет типа string. Ну и сам тип MessageType будет у нас объект. ",
            "type MessageType = typeof message; // тип MessageType возвращает нам тип объекта message.",
            "Таким образом, с помощью typeof получаем тип MessageType",
            "type MessageType = {",
            "- id: number;",
            "- text: string;",
            "}",
            "Далее, основываясь на этом типе, мы можем создавать нове сообщения, например: ",
            "const userMessage: MessageType = {",
            "- id: 123,",
            "- text: 'Hi!',",
            "}",
            "-*-",
            "5. Так же операторы keyof и typeof можно использовать вместе.",
            "Имеем:",
            "const message = {",
            "- id: 1,",
            "- text: 'JavaScript', ",
            "}",
            " // тип MessageType = { id: number, text: string } возвращает нам тип объекта message.",
            "- type MessageType = typeof message;",
            "Получим ключи типа MessageType:",
            "- type MessageKeys = keyof MessageType;",
            "И мы видим, что MessageKeys = 'id' | 'text' - это объединение литеральных типов.",
            "Если мы добавим в объект новое поле:",
            "const message = {",
            "- id: 1,",
            "- text: 'JavaScript', ",
            "- postId: 12,",
            "}",
            "то оно добавится в набор типа MessageKeys = 'id' | 'text' | 'postId' ",
            "Этот приём широко используется в enum. Например, у нас будет",
            " 4 мин 51 сек",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
        ],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", "", "", "", "", "", "", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
    {
        heading: "",
        answer: ["", "", "", ""],
        isParagraphBefore: true
    },
];
