import { ILinkInfo, IObjectHeadingAnswers } from "../models/types";

export const linksGeneralIssues: ILinkInfo[] = [
  {
    href: "https://mailsgun.ru/%D1%81%D0%BB%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%BA-%D0%B0%D0%B9%D1%82%D0%B8%D1%88%D0%BD%D0%B8%D0%BA%D0%B0-%D0%B8%D0%BB%D0%B8-%D1%87%D1%82%D0%BE-%D0%B3%D0%B4%D0%B5-%D0%BA%D1%83%D0%B4%D0%B0-%D1%87/",
    title: "Словарик айтишника или Что? Где? Куда? Часть 1",
  },
  {
    href: "https://fixer.io/",
    title: "Иностранная валюта курсы и валюта конверсионный JSON-API",
  },
  {
    href: "https://apilayer.com/account",
    title: "Curated API Marketplace. Кураторская торговая площадка API",
  },
  {
    href: "https://apilayer.com/marketplace/currency_data-api",
    title: "Currency Data API. API данных валюты",
  },
  {
    href: "https://apilayer.com/marketplace/exchangerates_data-api",
    title: "Exchange Rates Data API. API данных обменных курсов",
  },
  {
    href: "https://jsonplaceholder.typicode.com/",
    title: "{JSON} Placeholder",
  },
  {
    href: "https://dwstroy.ru/stail/plaginy-rasshireniya/emmet-shpargalka/ ",
    title: "EMMET ШПАРГАЛКА HTML, CSS. EMMET ШПАРГАЛКА ДЛЯ МОЛНИЕНОСНОСТНОЙ ВЕРСТКИ",
  },
  {
    href: " ",
    title: " ",
  },
];

export const arrayGeneralIssues: IObjectHeadingAnswers[] = [
  {
    heading: "HTML - Язык программирования",
    answer: [
      "HTML — стандартизированный язык гипертекстовой разметки документов для просмотра веб-страниц в браузере. Веб-браузеры получают HTML документ от сервера по протоколам HTTP/HTTPS или открывают с локального диска, далее интерпретируют код в интерфейс, который будет отображаться на экране монитора.",
    ],
    isParagraph: true,
  },
  {
    heading: "CSS",
    answer: [
      "Каскадная таблица стилей (CSS) формально является набором команд и инструментов для работы с внешним видом веб-страницы. Она делает интерфейс более восприимчивым и приятным – огромное количество сайтов работает на основе связки HTML и CSS. Как и в случае с языками программирования, существует множество готовых библиотек CSS, созданных профессионалами для удобства работы со стилями.",
    ],
    isParagraph: true,
  },
  {
    heading: "Что такое DOM?",
    answer: [
      "DOM (Document Object Model, объектная модель документа) — это программный интерфейс к HTML-документам, который позволяет воздействовать на документ из скриптов, меняя его стили, содержимое. В DOM документ представлен в виде дерева узлов.",
    ],
    isParagraph: true,
  },
  {
    heading: "Что такое API",
    answer: [
      "API - Application Programming Interface. Он обеспечивает взаимодействие между двумя системами. Это как винтик, который связывает две детали. Соответственно API могут быть не только в ВЭБ - приложении, они могут быть и в микроконтроллерах, и в каких то десктопных приложениях и т.д. ",
    ],
    isParagraph: true,
  },
  {
    heading: "Десктопные приложения",
    answer: [
      "Десктопные приложения – это программы, логика работы которых требует наличия оператора (человека работающего с программой), содержащие в себе всю полную функциональность и способные работать отдельно на любой машине изолированно от других приложений. Microsoft Word, Excel, Блокнот, однопользовательские игры – всё это примеры десктопных приложений. Для их работы необходимы лишь достаточные аппаратные ресурсы компьютера, само приложение и набор библиотек, содержащих функции для работы с приложением.",
      "Десктопные приложения могут быть также и многопользовательскими. Например, редактор файлов который в зависимости от логина и пароля, введенных при запуске, будет давать доступ к различным файлам. И программа и файлы находятся на одном компьютере, просто производится локальное разграничение доступа для разных пользователей.",
    ],
    isParagraph: true,
  },
  {
    heading: " ",
    answer: [" ", " "],
    isParagraph: true,
  },
];
